🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / environment-discovery/rds ](https://app.env0.com/p/fbd80c90-78fe-46c7-a401-7ab161ec02cb/environments/0aefb93f-3ab4-4139-9c24-bc71c3d964c4):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_db_instance.default will be created
+   resource "aws_db_instance" "default" {
+       address                               = (known after apply)
+       allocated_storage                     = 10
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_target                         = (known after apply)
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_name                               = "mydb"
+       db_subnet_group_name                  = (known after apply)
+       dedicated_log_volume                  = false
+       delete_automated_backups              = true
+       domain_fqdn                           = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "mysql"
+       engine_version                        = "8.0"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = (known after apply)
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t3.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       listener_endpoint                     = (known after apply)
+       maintenance_window                    = (known after apply)
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = "default.mysql8.0"
+       password                              = (sensitive value)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_throughput                    = (known after apply)
+       storage_type                          = (known after apply)
+       tags                                  = {
+           "env0_environment_id" = "0aefb93f-3ab4-4139-9c24-bc71c3d964c4"
+           "env0_project_id"     = "fbd80c90-78fe-46c7-a401-7ab161ec02cb"
        }
+       tags_all                              = {
+           "env0_environment_id" = "0aefb93f-3ab4-4139-9c24-bc71c3d964c4"
+           "env0_project_id"     = "fbd80c90-78fe-46c7-a401-7ab161ec02cb"
        }
+       timezone                              = (known after apply)
+       username                              = "admin"
+       vpc_security_group_ids                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>


```
Monthly cost change for adityamurali155/env0-managed-self-service-examples/.env0workdir/env0_tf_plan.json
Amount:  +$14 ($0.00 → $14)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: adityamurali155/env0-managed-self-service-examples/.env0workdir/env0_tf_plan.json

+ aws_db_instance.default
  +$14

+     Database instance (on-demand, Single-AZ, db.t3.micro)
      +$12

+     Storage (general purpose SSD, gp2)
      +$1

Monthly cost change for adityamurali155/env0-managed-self-service-examples/.env0workdir/env0_tf_plan.json
Amount:  +$14 ($0.00 → $14)

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

1 cloud resource was detected:
∙ 1 was estimated

Infracost estimate: Monthly cost will increase by $14 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                                  ┃ Baseline cost ┃ Usage cost ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ adityamurali155/env0-managed-se....env0workdir/env0_tf_plan.json ┃          +$14 ┃        +$0 ┃         +$14 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/fbd80c90-78fe-46c7-a401-7ab161ec02cb/environments/0aefb93f-3ab4-4139-9c24-bc71c3d964c4/deployments/d620dc94-2657-43ce-9c91-25f17e2dc101)